Revit 2024 API
GeometryElement.GetBoundingBox Method
Retrieves a box that encloses the geometry element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public BoundingBoxXYZ GetBoundingBox()
Visual Basic
Public Function GetBoundingBox As BoundingBoxXYZ
Visual C++
public:
BoundingBoxXYZ^ GetBoundingBox()
Return Value
The bounding box.
Remarks
Note: If the GeometryElement was obtained via Element.get_Geometry from an Element containing 2D geometry but no 3D geometry, the bounding box returned by this function may not be empty because it takes the 2D geometry into account.
See Also
GeometryElement Class
Autodesk.Revit.DB Namespace